events/API Call Events/competency.getForPerson/APIResponse - competency.getForPerson.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:s2="http://www.alert-project.eu/APIcall-request" xmlns:s3="http://www.alert-project.eu/APIcall-response" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>METADATASERVICE</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10020</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>ALERT.Metadata.APICallResponse</ns1:eventName>
								<ns1:eventId>9856</ns1:eventId>
								<ns1:eventType>reply</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<ns1:apiResponse>
									<!-- name of method -->
									<s3:apiCall>competency.getForPerson</s3:apiCall>
									<s3:responseData>
										<!-- list (or any other structure) of results -->
										<s3:areas>
                                                                                    <s3:area>
                                                                                        <s3:annotations>
                                                                                            <s3:annotation>#owl</s3:annotation>
                                                                                            <s3:annotation>#owl</s3:annotation>
                                                                                            <s3:annotation>#owl</s3:annotation>
                                                                                            <s3:annotation>#owl</s3:annotation>
                                                                                        </s3:annotations>
                                                                                        <s3:index>0.321</s3:index>
                                                                                        <s3:attributes>
                                                                                            <s3:fluency>
                                                                                                <s3:apiCount>0.32</s3:apiCount>
                                                                                                <s3:apiIntroduced>0.12</s3:apiIntroduced>
                                                                                                <s3:staticAnalysis>0.12</s3:staticAnalysis>
                                                                                            </s3:fluency>
                                                                                            <s3:contribution>
                                                                                                <s3:mailingListActivity>0.32</s3:mailingListActivity>
                                                                                                <s3:itsActivity>0.12</s3:itsActivity>
                                                                                                <s3:sloc>0.25</s3:sloc>
                                                                                            </s3:contribution>
                                                                                            <s3:effectiveness>
                                                                                                <s3:noOfIssuesFixed>0.001</s3:noOfIssuesFixed>
                                                                                                <s3:noOfCommitsCausedIssue>0.021</s3:noOfCommitsCausedIssue>
                                                                                                <s3:noOfCommitFixedIssue>0.001</s3:noOfCommitFixedIssue>
                                                                                            </s3:effectiveness>
                                                                                            <s3:recency>
                                                                                                <s3:timeSinceSCMaction>Sat, 05 Nov 2011 17:50:11 +0100</s3:timeSinceSCMaction>
                                                                                                <s3:timeSinceITSaction>Sat, 01 Nov 2011 20:50:11 +0100</s3:timeSinceITSaction>
                                                                                                <s3:timeSinceMLaction>Sat, 01 Nov 2011 10:50:11 +0100</s3:timeSinceMLaction>
                                                                                            </s3:recency>
                                                                                        </s3:attributes>
                                                                                    </s3:area>
                                                                                </s3:areas>
									</s3:responseData>
								</ns1:apiResponse>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>